#Область ПечатьДокумента

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	#Область ФормированиеТекстаЗапроса
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата,
	|	РеализацияТоваров.Контрагент,
	|	РеализацияТоваров.Номер,
	|	РеализацияТоваров.Товары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	#КонецОбласти
	
	#Область ПолучениеДанныхИзБД
	Выборка = Запрос.Выполнить().Выбрать();
	#КонецОбласти
	
	#Область ПодготовкаМакета
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьИтог = Макет.ПолучитьОбласть("Всего");
	#КонецОбласти
	
	#Область ВыводДанныхВТабличныйДокумент
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		
		// Вынесена в отдельную процедуру логика вывода товаров и расчета итога
		ВывестиТоварыИИтог(ТабДок, ВыборкаТовары, ОбластьТовары, ОбластьИтог);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	#КонецОбласти
	//}}
КонецПроцедуры

// Отдельная процедура для вывода табличной части и итоговой суммы
Процедура ВывестиТоварыИИтог(ТабДок, ВыборкаТовары, ОбластьТовары, ОбластьИтог)
	СуммаИтог = 0;
	
	Пока ВыборкаТовары.Следующий() Цикл
		ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
		ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		СуммаИтог = СуммаИтог + ВыборкаТовары.Сумма;	
	КонецЦикла;
	
	ОбластьИтог.Параметры.ВсегоПоДокументу = СуммаИтог;
	ТабДок.Вывести(ОбластьИтог);
КонецПроцедуры

#КонецОбласти